{"pageProps":{"postData":{"id":"p15","contentHtml":"<p>For a comfortable work with force.com as a developer you need configured workspace. If you work in a team, your team might has an own convention about workspace configuration, but if you work independently or your team hasn’t such convention, you should to rise up question about such convention. Below I describe the workspace configuration which was composed as a result of about 10 independent projects which were developed by one big team which was divided to a few little teams and was mixed between projects.</p>\n<p>Tools which would be used:</p>\n<ul>\n<li><strong><span style=\"line-height:13px;\">Eclipse IDE</span></strong></li>\n<li><strong>Apache ant + salesforce migration tool</strong></li>\n<li><strong>Git or Subversion or any other version control system</strong></li>\n</ul>\n<p>It’s a basic set of tools, and you can expand it for your needed. Usually my list of these tools expanded by:</p>\n<ul>\n<li><strong><span style=\"line-height:13px;\">Continuous integration server (Jenkins/Cruise Control/etc.)</span></strong></li>\n<li><strong>Apex Data Loader</strong></li>\n<li><strong>Force.com Explorer</strong></li>\n<li><strong>Real Force Explorer</strong></li>\n</ul>\n<p><strong>Eclipse</strong></p>\n<p>Make sure that jre or idk are installed as it required for eclipse installation. Download and unpack the latest version of <a href=\"http://www.eclipse.org/downloads/\">Eclipse IDE for Java EE Developers</a> to the appropriate location in your machine. My trick is unpack it to my Google Drive folder for a portable applications.</p>\n<p>Run Eclipse and install the following plugins:</p>\n<ul>\n<li><a href=\"http://www.adnsandbox.com/tools/ide/install/\">Force.com IDE</a></li>\n<li><a href=\"https://code.google.com/p/eclipse-glance/\">Eclipse Glance</a> (Incremental Text Search and Highlight)</li>\n<li>If you like it you can install plugin for version control which you’re going to use, like <a href=\"http://www.eclipse.org/subversive/\">Subversive</a> or <a href=\"http://www.eclipse.org/egit/\">Egit</a>.</li>\n<li>Also I use the <a href=\"http://andrei.gmxhome.de/anyedit/\">AnyEdit tools</a> and <a href=\"http://scharf.gr/eclipse/fullscreen/update/\">Fullscreen</a></li>\n</ul>\n<p>That’s all.</p>\n<p><strong>Apache Ant</strong></p>\n<p>When you work with force.com platform the Apache Ant is incredible tool. Really. In a few projects I used it and a simple text editor like Notepad++ instead using Eclipse and other tools. If you’re going to work with salesforce.com as your primary platform you should know this tool.</p>\n<p>First of all download, install &#x26; configure Apache Ant. After that you need to download ant migration tool, the link to the latest version of it is available in your salesforce.com org through Setup –> Develop –> Tools. Here you can find links to the most popular tools. Just unpack and copy <strong>ant-salesforce.jar</strong> to “lib” folder into your ANT_HOME directory. So, ant migration tool is ready for use. For start it’s enough. More information about ant migration tool you can find<a href=\"http://blog.pavelslepenkov.info/?cat=9\"> here</a>.</p>\n<p><strong>Version Control</strong></p>\n<p>I sure that you want to feel safe. That is aim of every version control system. If you’re a greenhorn in version control I suggest to start with Git. It’s awesome vcs that allows you travel back in time in your code. You can install <a href=\"http://git-scm.com/\">Git</a>, <a href=\"http://sourcetreeapp.com/\">SourceTree</a>, <a href=\"http://www.eclipse.org/egit/\">EGit</a> if you prefer to use it from Eclipse. As a hosting for git projects you can use <a href=\"https://github.com/\">GitHub </a>or <a href=\"https://bitbucket.org/\">Bitbucket</a>, which is my choice. The other option is Subversion, you can install <a href=\"http://tortoisesvn.net/\">TortoiseSvn</a> or Eclipse plugin like <a href=\"http://www.eclipse.org/subversive/\">Subversive</a> or <a href=\"http://subclipse.tigris.org/\">Subclipse</a>. I use TortoiseSvn + WinMerge as a merge client.</p>\n<p>So, it’s all what you need for a start with salesforce.com as your primary development platform.</p>\n","title":"Setting up development environment for force.com platform","date":"2013-07-17T00:29:18+01:00","status":"publish","permalink":"/?p=15","author":"pavel","excerpt":"","type":"post","category":["force.com"],"tag":["force.com","tools","workspace"],"post_format":[],"original_post_id":["15"],"dsq_thread_id":["5601403271"]}},"__N_SSG":true}