{"pageProps":{"bookData":{"id":"jun2023","contentHtml":"<p>What's I was reading/watching in June 2023</p>\n<p><strong>1. Captain Volkonogov escaped (Капитан Волконогов бежал)</strong></p>\n<p>It's really hard to explain how deep this movie hit my soul and mind. The action is set on 1938 when <a href=\"https://en.wikipedia.org/wiki/Great_Purge\">Great Purge</a> was in its peak. The movie is a drama, a grotesque, burlesque and comedy somehow, though it's very deep and aestetic and not related to Soviet Union at all, it's set in timelessness.</p>\n<iframe width=\"1100\" height=\"620\" src=\"https://www.youtube.com/embed/X0qakaKE-aM\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<p>Plot shows us the story of captain Volkonogov who was tortuing and executing a lot of innocent people for a years until it's his turn to be a victim. Initially he's just trying to get away of the execution until the ghost of his colleague told him to get forgiveness from relatives of the victims who were executed with his help if he wanna to be in the Heaven. That's super interesting twist as soviet union's people declared to be atheist and such a mustic motivation looks very interesting. So, instead of hiding he got folder of executed ones and trying to find forgiveness. And I feel it like an analogue to Divine Comedy where captain already in the Hell and he just going by circle, when reach souls of victims and their relatives, each dialog between captain and the victim's relatives is masterpiece.</p>\n<p>The next dialog is a main for a whole movie, it explains a lot about so many things which happend in 2020-2023</p>\n<blockquote class=\"stacked\">\n    — А вот как думаешь, капитан, почему они все твердят, что невиновны?<br/>\n    — Ну, наверное, они надеются уйти от ответственности…<br/>\n    — Вот ты с виду вроде умный парень, а нихуя в диалектике не петришь. Запомни: они на самом деле считают, что они невиновны, потому что они на самом деле невиновны. Те, кого мы допрашиваем, на самом деле не террористы, не шпионы, не предатели. Но при этом все они попадают к нам неслучайно. Потому что все они ненадёжные элементы. По разным причинам. У кого-то происхождение сомнительное, у кого-то родных, он один оказался, а внутри обиду затаил. Кто-то, например, вообще поляк или, там, немец. А, значит, уже без пяти минут шпион. Ну а кто-то просто не любит родину. Да, есть и такие вот, не любят, и всё. И ты даже не представляешь, сколько всяких таких ненадёжных. И это же ой как опасно. И сам знаешь, какое сейчас время. Страна в кольце врагов, большая война на носу. И вот как все эти ненадёжные себя поведут, когда она начнётся, а? Да, сейчас они невиновны, но они будут виновны потом. И мы не можем просто сидеть и ждать. Потому что, когда они превратятся в шпионов, террористов, вредителей, будет уже поздно. Поэтому мы их сажаем и расстреливаем. Сегодня, сейчас, заблаговременно. Это и называется профилактика потенциального врага, Федя. Вот чем мы с тобою занимаемся.<br/>\n    - Получается, что принуждаем их сознаваться в том, чего они не делали? И даже не собирались делать.<br/>\n    - Но ведь не можем мы их сажать и расстреливать ни за что, просто так, у нас ведь правовое государство. На каждое наказание должно быть преступление. Усек?\n</blockquote>\n<p><i>My pretty bad translation:</i></p>\n<blockquote class=\"stacked\">\n    — So, captain, why do you think they keep insisting they're innocent?<br/>\n    — Well, I suppose they're hoping to avoid responsibility...<br/>\n    — You seem like a smart guy, though you’re fucking bad in dialectics. <b>Remember this: they genuinely believe they're innocent because they actually are innocent.</b> The people we interrogate are not terrorists, spies, or traitors. But there's a reason why they end up here, with us. It's not a coincidence. It's because they are unreliable individuals for various reasons. Some have questionable backgrounds, others have lost their loved ones and harbored grudges. Some are Polish or German, and that automatically makes them potential spies. And then there are those who simply don't love their homeland. Yes, there are such people, they don't love it at all. And you can't even imagine how many of these unreliable individuals there are. It's dangerously alarming. And you know what time it is now, right? The country is surrounded by enemies, a big war is imminent. And how do you think all these unreliable people will behave when it starts? Yes, right now they're innocent, but they will be guilty later. And we can't just sit and wait. Because when they turn into spies, terrorists, troublemakers, it will be too late. That's why we imprison and execute them. Today, right now, as a preventive measure against potential enemies, Fedya. That's what we're doing, you and me.<br/>\n    — So, you're saying we're forcing them to confess to things they didn't do? Things they didn't even plan to do?<br/>\n    — But we can't imprison and execute them for no reason, just like that. We have a rule of law in our state. There must be a crime for every punishment. Got that?\n</blockquote>\n<p><strong>2. One-Minute Time Machine - The Short Film by Devon Avery.</strong></p>\n<p>Just a nice short film</p>\n<iframe width=\"1100\" height=\"620\" src=\"https://www.youtube.com/embed/CXhnPLMIET0\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<p><strong>3. <a href=\"https://www.matthewball.vc/all/bigtechbiggestbets\">Big Tech’s Biggest Bets (Or What It Takes to Build a Billion-User Platform)</a></strong></p>\n<blockquote class=\"stacked\">\nBy my estimates, Meta has spent approximately $56B on its Reality Labs division since 2012, and generated about $7B in cumulative revenue over the same period, producing a $49B net loss.\n</blockquote>\n<p>The next part is just <strong>fascinating</strong>. It's hard to belive that Meta spent so much on hardware research. This looks so cool as I was sure that Meta is just an Ad's machine which spends mostly on dark UX patternt and engagement researches to make you spend as much as possible time on their platforms.</p>\n<blockquote class=\"stacked\">\nMeta reports that 90% of its investments in the category are hardware-related innovations in optics, microLEDs, batteries, cameras, sensors, and the like.\n</blockquote>\nSo, it appeared they push this world forward even after modern social media creation.\n<p>While such a big companies trying to create a new niche or to disrupt existing one their looses might seem drastic.</p>\n<blockquote class=\"stacked\">\nBut 2014, the year that Bezos’s letter addressed, saw the largest new business failure in Amazon’s 20-year history. In July, the company released its first (and only) smartphone, the <a href=\"https://en.wikipedia.org/wiki/Fire_Phone\">Fire Phone</a>. Unlike Amazon’s other hardware plays, it was fairly late to market. The Kindle was not the first e-reader, <b>but it effectively pioneered the category</b>. The Kindle Fire tablet debuted barely after the iPad. The Fire Phone, meanwhile, came seven years after the iPhone, six after Android, and at a comparable price.\n</blockquote>\nIt was discontinued in just a one year after the release on August 2015, and it was difenitelly a huge commercial failure for Amazon.\n<blockquote class=\"stacked\">\nBezos's note to shareholders: “As a company grows, everything needs to scale, including the size of your failed experiments. If the size of your failures isn’t growing, you’re not going to be inventing at a size that can actually move the needle.”\n</blockquote>\n<p>Bit Tech constantly looks for a new niches which might create a billions dollar market, or provide market advantage. It's definitelly not easy, it requires willingness and courage as commulative losses might look so much high. It's constant fight against investors and their fears, seeking what customers need and explanation of why they need it.</p>\n<blockquote class=\"stacked\">\ndominant platform owners can use their influence to rapidly gain share in categories that they’ve ignored for years and that competitors have long since conquered. In 2021, Apple mandated that any application that supported third-party account systems (e.g., if you could log in to the New York Times  appwith a Facebook account), the application would also need to support with a iCloud login. Of course, this effectively meant that the application had to support iCloud login everywhere else (e.g., Web, Roku devices, Androids) so that users could log in when not using their iOS device! As a result, Apple was able to rapidly become one of the largest identity providers on the Internet even though its solution came to market decades after the market leaders and offered limited experiential differentiation. And by providing this service, Apple is able to track and understand the behaviors of iOS users across the devices of its competitors.\n</blockquote>\n<p>Some other takeaways:</p>\n<ul>\n<li>Apple is one of the most successfull company in building platforms, and even in building platforms on top of their own platforms. Google follows with Android which forces OEMs to use other Google's services.</li>\n<li>All the BigTech are in the state of cold war, when they could not afford not to cooperate with each other and on the same time each of them might create a lot of problem to its rivals.</li>\n<li>Most of the platforms and ecosystems are controlled and it's almost financially impossible to compete. Even if you have a great product, to challenge the status quo you need enormous amount of money which most investors wouldn't approve to spend on such a risky operation. Even if you're Microsoft, it's extremelly hard to challenge Google on search.</li>\n</ul>\n","title":"Cool stuff - June 2023","date":"2023-06-02T07:23:10+00:00","status":"publish","author":"pavel","type":"monthly-report","tag":["articles","reading","2023"]}},"__N_SSG":true}