{"pageProps":{"postData":{"id":"p65","contentHtml":"<p><strong>1. In a recruiting application, a Position custom object is related to a Salary custom object. Sensitive information, such as current salary, is stored on the Salary object. All users should be able to at least view position information. However, only select individuals should be able to read salary records.</strong></p>\n<p><strong>How should a developer accomplish this?</strong></p>\n<ul>\n<li><strong>A. create a lookup relationship between Position and Salary; set organization-wide defaults to Public Read-Only for Position and Private for Salary.</strong></li>\n<li><strong>B. create a lookup relationship betweeb Position and Salary; set organization-wide defaults to Private for Position and Salary</strong></li>\n<li><strong>C. create a master-detail relationship between Position and Salary; set organization-wide defaults to Public Read-Only for Position and Private for Salary</strong></li>\n<li><strong>D. create a master-detail relationship between Position and Salary; set organization-wide defaults to Private for Position and Salary</strong></li>\n</ul>\n<p>This question refers to <strong><a href=\"http://www.salesforce.com/us/developer/docs/api/Content/relationships_among_objects.htm\">Relationship types</a></strong> and <strong><a href=\"http://login.salesforce.com/help/doc/en/security_data_access.htm\">Record Level Security</a></strong>. The first part of provided answers is about relationship type which should be selected for the given model. In our case we have one-to-one relationship, where Salary object should be a <strong>detail record</strong> for Position record, and on the one hand seems that it should support the key feature of master-detail relationship:</p>\n<ul>\n<li>When a record of the master object is deleted, its related detail records are also deleted.</li>\n</ul>\n<p>It’s very significant point in this question because the Salary record shouldn’t exist without Position record, and when we remove a Position the Salary record should be deleted too, but on the other hand within the master-detail relationship <strong>we can’t set a different organization-wide defaults for detail record</strong>, because it is inherited from the master record. In our case we need Public Read-Only access for Position, because these records should be visible for all users, and Salary records should be restricted thus we need to set it to Private (“you use organization-wide sharing settings to lock down your data to the most restrictive level, and then use the other record-level security and sharing tools to selectively give access to other users.”). The second point is more significant for us because it refers to security model, therefore the correct answer is A.</p>\n<p><strong>2. In a recruiting application, all users should be able to see and edit all candidate records, but interviewers should NOT be able to modify the address of a candidate and should NOT be able to see the birth date of a candidate.</strong></p>\n<p><strong>How would a developer meet this requirement?</strong></p>\n<ul>\n<li><strong>A. set the organization wide default for candidates to Edit Some Fields</strong></li>\n<li><strong>B. set the organization wide default for candidates to Read-only</strong></li>\n<li><strong>C. remove the Edit permission on candidates from the inteviewers’ profile</strong></li>\n<li><strong>D. use field-level security to control access to the Address and Birth Date fields</strong></li>\n</ul>\n<p>This question hasn’t any pitfalls. The correct answer is D, because for a restricting or a granting access for a specified fields on objects, we should use the field-level security.</p>\n<p><strong>3. Which element is included in the security model for Force.com Sites?</strong></p>\n<p><strong>Choose 2 answers</strong></p>\n<ul>\n<li><strong><span style=\"line-height:13px;\">A. Full CRUD permissions on all custom objects</span></strong></li>\n<li><strong>B. Read/write permissions on all standard objects</strong></li>\n<li><strong>C. Named Visualforce pages</strong></li>\n<li><strong>D. restricted IP ranges</strong></li>\n</ul>\n<p>The correct answers are A,B. C isn’t about security, and D isn’t about Sites, because we talk about <a href=\"http://na9.salesforce.com/help/doc/en/sites_public_access_settings.htm\">public access setting</a>.</p>\n<p>The post will be updated soon with new questions…</p>\n","title":"Dev 401 certification questions: Security model","date":"2013-07-22T23:45:41+01:00","status":"publish","permalink":"/?p=65","author":"pavel","excerpt":"","type":"post","category":["certification"],"tag":["certification","salesforce"],"post_format":[],"fplayout":["fullwidth"],"original_post_id":["65"],"dsq_thread_id":["5591195540"]}},"__N_SSG":true}